import type { BuildStyle, GearData, AffixItem } from '$lib/types';

export const buildStyles: Record<string, BuildStyle> = {
	鳴金虹: {
		rec: ['易水歌', '無名心法', '千山法', '威猛歌'],
		gear: ['玉斗套裝', '飛隼套裝']
	},
	鳴金影: {
		rec: ['易水歌', '劍氣縱橫', '逐狼心經', '凝神章'],
		gear: ['飛隼套裝']
	},
	牽絲玉: {
		branches: {
			走地玉: ['易水歌', '征人歸', '花上月令', '縱地摘星'],
			飛天玉: ['易水歌', '征人歸', '花上月令', '縱地摘星']
		},
		gear: ['飛隼套裝', '煙柳重重套裝']
	},
	牽絲霖: {
		branches: {
			純奶: ['易水歌', '君臣藥', '千絲蠱', '杏花不見'],
			輸出奶: ['易水歌', '征人歸', '君臣藥', '怒斬馬']
		},
		gear: ['浣花套裝', '時雨套裝']
	},
	破竹風: {
		rec: ['易水歌', '極樂泣血', '忘川絕響', '心彌泥魚'],
		gear: ['飛隼套裝', '燕歸套裝']
	},
	破竹塵: {
		rec: ['易水歌', '斷石之構', '繩舟行木', '千營一呼'],
		gear: ['連星套裝']
	},
	裂石威: {
		rec: ['易水歌', '移經易武', '穿喉訣', '山河絕韻'],
		gear: ['時雨套裝', '易相套裝']
	},
	裂石鈞: {
		branches: {
			陌刀主C: ['易水歌', '移經易武', '斷石之構', '孤忠不辭'],
			唐橫刀主C: ['磐石訣', '威猛歌', '千山法', '易水歌', '征人歸']
		},
		gear: ['嶽山傾套裝', '時雨套裝']
	},
	玉傘霖扇: {
		rec: ['易水歌', '怒斬馬', '君臣藥', '花上月令'],
		gear: ['飛隼套裝', '煙柳重重套裝']
	}
};

export const gearData: GearData = {
	玉斗套裝: {
		type: '攻擊',
		drop: '菩提苦海、春秋別館',
		p2: '最大外功攻擊 +15',
		p4: '武學技釋放後可啟動玉斗效果：會意傷害提升10%，且對處於控制狀態或真氣值低於40%的目標，造成的會意傷害額外增加20%，持續12秒。此效果每30秒只能生效一次。'
	},
	時雨套裝: {
		type: '攻擊+治療',
		drop: '無憂洞',
		p2: '氣血最大值 +560',
		p4: '造成的所有會心傷害和治療提升10%，且在自身處於氣血護盾狀態時額外提升15%'
	},
	嶽山傾套裝: {
		type: '攻擊',
		drop: '待補充',
		p2: '最小外功攻擊 +15',
		p4: '對於氣血值高於50%的目標造成的傷害增加5%，每多5%氣血值額外增加1%，最多提升10%'
	},
	煙柳重重套裝: {
		type: '攻擊',
		drop: '待補充',
		p2: '精准率 +1.5%',
		p4: '輕擊/空中輕擊命中後重擊/空中重擊傷害提升12%，持續10秒，反之亦然。特別的是，重擊/空中重擊命中後還會使輕擊蓄力傷害提升12%'
	},
	連星套裝: { type: '未知', drop: '暫無數據', p2: '暫無詳細數據', p4: '暫無詳細數據' },
	易相套裝: {
		type: '防禦',
		drop: '菩提苦海、佛光頂(脛甲)、春秋別館',
		p2: '外功防禦 +7',
		p4: '自身釋放的護盾持續時間延長2秒。真氣高於85%或真氣傷害免疫護盾期間，受到的所有氣血傷害降低20%'
	},
	桂月套裝: {
		type: '防禦',
		drop: '無憂洞、大義熔爐(脛甲)',
		p2: '氣血最大值 +320',
		p4: '防禦中被攻擊，有30%機率產生一個吸收傷害量為10%氣血上限的護盾，持續20秒，如目前已存在護盾，則額外回復2%氣血值。此效果每60秒只能生效一次'
	},
	御無缺套裝: {
		type: '防禦',
		drop: '待補充',
		p2: '外功防禦 +7',
		p4: '受到傷害降低5%，氣血低於60%時，每損失10%血量，受到傷害額外降低1%，最多疊加5層'
	},
	不知寒套裝: {
		type: '防禦',
		drop: '大義熔爐(脛甲)',
		p2: '氣血最大值 +560',
		p4: '進入戰鬥狀態後，若保持10秒不受傷害可立即獲得不知寒效果：下次受擊傷害和受擊後2秒內受到的所有傷害都可以降低40%。不知寒效果在離開戰鬥狀態時會移除'
	},
	抱玉套裝: { type: '未知', drop: '暫無數據', p2: '暫無詳細數據', p4: '暫無詳細數據' },
	飛隼套裝: {
		type: '攻擊',
		drop: '弱水岸、熒淵',
		p2: '會意率 +0.5%',
		p4: '造成的所有傷害觸發會意時可獲得飛隼效果：外功攻擊會提升2%，持續5秒，最多可疊加5層'
	},
	急風驟套裝: {
		type: '攻擊',
		drop: '待補充',
		p2: '最大外功攻擊 +8',
		p4: '空中重擊傷害提升10%，並可額外造成擊倒效果。擊倒效果每10秒只能觸發一次'
	},
	燕歸套裝: {
		type: '攻擊',
		drop: '不羨仙、金明池',
		p2: '最小外功攻擊 +15',
		p4: '輕擊對真氣值低於40%的目標造成的外攻傷害增加15%，對氣竭目標額外增加5%'
	},
	浣花套裝: {
		type: '攻擊+治療',
		drop: '常平倉',
		p2: '會心率 +1.7%',
		p4: '滿氣血狀態下有額外5%機率造成會心治療和會心傷害，且會心治療和會心傷害效果提升15%'
	},
	鷹揚套裝: {
		type: '防禦',
		drop: '佛光頂(脛甲)、弱水岸、熒淵',
		p2: '外功防禦 +7',
		p4: '每次造成持續傷害或治療時可給自身添加1層鷹揚效果：受到傷害降低1.2%，持續10秒，最多可疊5層。滿層時可以獲得一個鷹護效果:10秒內下次受擊傷害降低90%(來源是首領時效果減半)，此效果每30秒只能觸發一次'
	},
	凌波步套裝: {
		type: '防禦',
		drop: '待補充',
		p2: '氣血最大值 +560',
		p4: '卸勢成功時觸發額外效果，接下來2秒內受到的所有傷害降低20%，最多可疊加3層'
	},
	江凝套裝: {
		type: '功能',
		drop: '佛光頂(脛甲)、不羨仙、金明池',
		p2: '外功防禦 +4',
		p4: '完美閃避敵人有50%的機率回復自身3%最大生命值和10點耐力'
	},
	梨雪套裝: {
		type: '功能',
		drop: '常平倉、大義熔爐(脛甲)',
		p2: '外功防禦 +7',
		p4: '當遭受的單次傷害超過最大氣血值40%或自身氣血值低於20%時，5秒內下次治療額外為自身治療25%最大氣血值，每60秒最多生效一次'
	}
};

export const affixData: {
	initial: AffixItem[];
	rare: AffixItem[];
	transfer: string;
} = {
	initial: [
		{ part: '武器', priority: ['最大外功', '最小外功', '敏、勢'] },
		{ part: '首飾', priority: ['最大外功', '最小外功'] },
		{ part: '頭、胸', priority: ['會心率、會意率', '精準率', '最大氣血、外功防禦'] },
		{
			part: '脛甲、腕甲',
			priority: ['會心率、會意率、勁', '精準率', '體、御、最大氣血、外功防禦']
		}
	],
	rare: [
		{ part: '武器', effect: '特定武器武學增效' },
		{ part: '首飾', effect: '全武學增效' },
		{ part: '頭/胸', effect: '單體類奇術增傷 / 群體類奇術增傷' },
		{ part: '脛甲/腕甲', effect: '對首領單位增傷 / 對玩家單位增效' }
	],
	transfer: '轉律庫資料待更新...'
};
